# PhaseSequenceNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhaseSequenceNumber Property
ParameterTypeId Class See Also
---
"Sequence Number"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhaseSequenceNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhaseSequenceNumber As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhaseSequenceNumber {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace